gregnetzel/CPSC-5530/FreeRTOS/Demo/CORTEX_LM3Sxxxx_IAR_Keil/main.c
  for(;;){
     vTaskDelayUntil( &xLastWakeTime, xFrequency );
     modTemp();
     modSys();
     modDia();
     ekgCapture();
     vTaskDelayUntil( &xLastWakeTime, xFrequency );
  }
}

void fillBuffers() {
  for(int i = 0; i < 8; i++) {
    tempRawBuff[i] = 75;
    bloodPressRawBuff[i] = 80;
    bloodPressRawBuff[i+8] = 80;
    pulseRateRawBuff[i] = 0;
  }
}

void modTemp(){
  if(tempForward){
    tempRawBuff[j] += 2;
    if(tempRawBuff[j] > 50)
      tempForward = FALSE;
  }
  else{
    tempRawBuff[j] -= 2;
    if(tempRawBuff[j] < 15)
      tempForward = TRUE;
  }
}

void modSys(){
  if(sysForward){
    bloodPressRawBuff[j] += 2;
    if(bloodPressRawBuff[j] > 150)
      sysForward = FALSE;
  }
  else{
    bloodPressRawBuff[j] -= 2;
    if(bloodPressRawBuff[j] < 50)
      sysForward = TRUE;
  }
}

void modDia(){
  if(diaForward){
    bloodPressRawBuff[j+8] += 2;
    if(bloodPressRawBuff[j+8] > 150)
      sysForward = FALSE;
  }
  else{
    bloodPressRawBuff[j+8] -= 2;
    if(bloodPressRawBuff[j+8] < 50)
      diaForward = TRUE;
  }
}

/*void modHR(){
  if(pulseForward){
    pulseRateRawBuff[j] += 3;
    if(pulseRateRawBuff[j] > 40)
      pulseForward = FALSE;
  }
  else{
    pulseRateRawBuff[j] -= 3;
    if(pulseRateRawBuff[j] < 20)
      pulseForward = TRUE;
    
  }
}*/

void ekgCapture(){
  double pi = 3.14159265358979323846;
  double frequency = 40+(time(0)%80); //heart rate ranging from 40-120
  double omega = 2*pi*frequency;
  float t = 0;
  for(int i= 0; i < 256; i++){
    pulseRateRawBuff[i] = (int)(3 * sin(omega*t));
    t += 0.000125;
  }
}

void ekgProcessing(){
  int empty[256];
  for(int i = 0; i < 256; i++){
    empty[i] = 0;
  }
  pulseRateCorrectedBuff[j] = optfft(pulseRateRawBuff, empty);
}

void vCompute(void *pvParameters){
  TickType_t xLastWakeTime;
  const TickType_t xFrequency = 20; //ticks to wait
  xLastWakeTime = xTaskGetTickCount();
  
  for(;;){
     vTaskDelayUntil( &xLastWakeTime, xFrequency );
     
     tempCorrectedBuff[j] = 5 + 0.75*tempRawBuff[j];
     bloodPressCorrectedBuff[j] = 9 + 2*bloodPressRawBuff[j];
     bloodPressCorrectedBuff[j+8] = 6 + (int)1.5*bloodPressRawBuff[j+8];
     ekgProcessing();
  }
}

void vAnnunciate(void *pvParameters){
  TickType_t xLastWakeTime;
  const TickType_t xFrequency = 20;
  const TickType_t xBPfreq = 200;
  const TickType_t xHRfreq = 300;
  const TickType_t xTempfreq = 400;
  const TickType_t xBatfreq = 100;
  xLastWakeTime = xTaskGetTickCount();
  int a; //for blinking loops
  for(;;){
     vTaskDelayUntil( &xLastWakeTime, xFrequency );
     
     float t = (float)tempRawBuff[j];
     unsigned int s = bloodPressRawBuff[j];
     float d = (float)bloodPressRawBuff[j+8];
     unsigned int h = pulseRateRawBuff[j];
     short b = batteryState;
     
     t = 5 + (0.75*t);
     s = 9 + (2 * s);
     d = 6 + (1.5*d);
     h = 8 + (3 * h);
     
     if( b < 40 ){//battery
       for( a = 0; a < 3; a++ ){
         GPIO_PORTF_DATA_R |= 0x01;
         vTaskDelayUntil( &xLastWakeTime, xBatfreq );
         GPIO_PORTF_DATA_R &= ~(0x01); // Turn off the LED
         vTaskDelayUntil( &xLastWakeTime, xBatfreq );
       }       
     }
     if( h > 100 || h < 60 ){//hr
       for( a = 0; a < 3; a++ ){
         GPIO_PORTF_DATA_R |= 0x01;
         vTaskDelayUntil( &xLastWakeTime, xHRfreq );
         GPIO_PORTF_DATA_R &= ~(0x01);          // Turn off the LED
         vTaskDelayUntil( &xLastWakeTime, xHRfreq );
       }
     }
     if(t > 37.8 || t < 36.1){                  //temp
       for( a = 0; a < 3; a++ ){
         GPIO_PORTF_DATA_R |= 0x01;
         vTaskDelayUntil( &xLastWakeTime, xTempfreq );
         GPIO_PORTF_DATA_R &= ~(0x01);          //Turn off the LED
         vTaskDelayUntil( &xLastWakeTime, xTempfreq );
       }
     }
     if(s > 120 || s < 90 || d > 80 || d < 60){ //bp
       if(s > 144){      
         PWMGenEnable(PWM_BASE, PWM_GEN_0);     //Make sounds
         vTaskDelayUntil( &xLastWakeTime, xBPfreq );
         PWMGenDisable(PWM_BASE, PWM_GEN_0);
       }
       for( a = 0; a < 3; a++ ){
         GPIO_PORTF_DATA_R |= 0x01;
         vTaskDelayUntil( &xLastWakeTime, xBPfreq );
         GPIO_PORTF_DATA_R &= ~(0x01);
         vTaskDelayUntil( &xLastWakeTime, xBPfreq );
       }      
     }
  }
}

void vStatus(void *pvParameters){
  TickType_t xLastWakeTime;
  const TickType_t xFrequency = 1500; //ticks to wait
  xLastWakeTime = xTaskGetTickCount();
  
  for(;;){
     vTaskDelayUntil( &xLastWakeTime, xFrequency );
     batteryState--;
  }
}

void vSerialComms(void *pvParameters){
  TickType_t xLastWakeTime;
  const TickType_t xFrequency = 3000; //ticks to wait
  xLastWakeTime = xTaskGetTickCount();
  
  for(;;){
    vTaskDelayUntil( &xLastWakeTime, xFrequency );
    
    sprintf(comBuffer,"1.Temperature:  %d\n2. Systolic pressure: %dmmHG\n3. Dyastolic pressure: %dmmHG\n4. Pulse rate: %dBPM\n5. Battery: %d",
            tempCorrectedBuff[0],bloodPressCorrectedBuff[0],bloodPressCorrectedBuff[8],pulseRateCorrectedBuff[0],batteryState);
    
    char* buf = &comBuffer[0];
    while(UARTBusy(UART0_BASE));
    while(*buf != '\0'){
      UARTCharPut(UART0_BASE, *buf++);
    }
  }
}

void increaseCuff(){
  if(cuffPressure >= 10){
    cuffPressure *= 1.1;
    if(cuffPressure > bloodPressCorrectedBuff[j+8] && cuffPressure > bloodPressCorrectedBuff[j] && cuffHigh == FALSE){
      cuffHigh = TRUE;
    }
  }
  else
    cuffPressure = 10;
}

void decreaseCuff(){
  if(cuffPressure >= 10){
    cuffPressure *= .9;
    if(cuffPressure < bloodPressCorrectedBuff[j] && cuffHigh == TRUE && cuffSys == FALSE){
      cuffSys = TRUE;
      lastSysPress = bloodPressCorrectedBuff[j];
    }
    else if(cuffPressure < bloodPressCorrectedBuff[j+8] && cuffHigh == TRUE && cuffDia == FALSE){
      cuffDia = TRUE;
      lastDiaPress = bloodPressCorrectedBuff[j+8];
    }
    if(cuffHigh && cuffSys && cuffDia){
      cuffHigh = FALSE;
      cuffSys = FALSE;
      cuffDia = FALSE;
    }
  }
  else
    cuffPressure = 10;
}

void print(char* c, int hOffset, int vOffset) {                         // string, column, row
  RIT128x96x4StringDraw(c, hSpacing*(hOffset), vSpacing*(vOffset), 15);
}

