gregnetzel/CPSC-5530/FreeRTOS/Demo/CORTEX_LM3Sxxxx_IAR_Keil/main.c
void intPrint(int c, int size, int hOffset, int vOffset) {              // number, size of number,column, row
  char dec[2];
  dec[1] = '\0';
  int rem = c;
  for (int i = size - 1; i >= 0; i--) {
    dec[0] = rem % 10 + '0';
    rem = rem / 10;
    RIT128x96x4StringDraw(dec, hSpacing*(hOffset + i), vSpacing*(vOffset), 15);
  }
}

void fPrint(float c, int size, int hOffset, int vOffset) {              // number, size of number,column, row 
  char dec[2];
  dec[1] = '\0';
  int rem = (int)c * 10;
  for (int i = size - 1; i >= 0; i--) {
    if (i == size - 2)
      RIT128x96x4StringDraw(".", hSpacing*(hOffset + i), vSpacing*(vOffset), 15);
    else {
      dec[0] = rem % 10 + '0';
      rem = rem / 10;
      RIT128x96x4StringDraw(dec, hSpacing*(hOffset + i), vSpacing*(vOffset), 15);
    }
  }
}

/* Built in Functions */
void prvSetupHardware( void ){
  /* If running on Rev A2 silicon, turn the LDO voltage up to 2.75V.  This is
    a workaround to allow the PLL to operate reliably. */
  if( DEVICE_IS_REVA2 ){
    SysCtlLDOSet( SYSCTL_LDO_2_75V );
  }
  
  /* Set the clocking to run from the PLL at 50 MHz */
  SysCtlClockSet( SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN | SYSCTL_XTAL_8MHZ );
  
  /* 	Enable Port F for Ethernet LEDs
		LED0        Bit 3   Output
		LED1        Bit 2   Output */
  SysCtlPeripheralEnable( SYSCTL_PERIPH_GPIOF );
  GPIODirModeSet( GPIO_PORTF_BASE, (GPIO_PIN_2 | GPIO_PIN_3), GPIO_DIR_MODE_HW );
  GPIOPadConfigSet( GPIO_PORTF_BASE, (GPIO_PIN_2 | GPIO_PIN_3 ), GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD );
  
  /* setup buttons */
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);         
  GPIOPinTypeGPIOInput(GPIO_PORTE_BASE, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2);
  GPIOPadConfigSet(GPIO_PORTE_BASE, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);
  GPIOIntTypeSet(GPIO_PORTE_BASE, GPIO_PIN_0 | GPIO_PIN_1, GPIO_FALLING_EDGE);
  GPIOPinIntEnable(GPIO_PORTE_BASE, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2);
  IntEnable(INT_GPIOE);
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);  
  GPIOPinTypeGPIOInput(GPIO_PORTF_BASE, GPIO_PIN_1);
  GPIOPadConfigSet(GPIO_PORTF_BASE, GPIO_PIN_1, GPIO_STRENGTH_2MA,GPIO_PIN_TYPE_STD_WPU);
  GPIOIntTypeSet(GPIO_PORTF_BASE, GPIO_PIN_1, GPIO_FALLING_EDGE);
  GPIOPinIntEnable(GPIO_PORTF_BASE, GPIO_PIN_1);
  IntEnable(INT_GPIOF);
  
  /* setup speaker */
  SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM); 
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
  GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_0);
  GPIOPinTypePWM(GPIO_PORTG_BASE, GPIO_PIN_1);
  unsigned long ulPeriod = SysCtlClockGet() / 440;
  PWMGenConfigure(PWM_BASE, PWM_GEN_0, PWM_GEN_MODE_UP_DOWN | PWM_GEN_MODE_NO_SYNC);
  PWMGenPeriodSet(PWM_BASE, PWM_GEN_0, ulPeriod);
  PWMPulseWidthSet(PWM_BASE, PWM_OUT_0, ulPeriod / 4);
  PWMPulseWidthSet(PWM_BASE, PWM_OUT_1, ulPeriod * 3 / 4);
  
  /* setup serial communication */
//  SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);                        //uncomment before submit
//  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
//  GPIOPinConfigure(GPIO_PA0_U0RX);
//  GPIOPinConfigure(GPIO_PA1_U0TX); 
//  GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0|GPIO_PIN_1);
//  IntEnable(INT_UART0);
//  UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
//  UARTConfigSetExpClk(UART0_BASE, SysCtlClockGet(), 115200, UART_CONFIG_WLEN_8|UART_CONFIG_PAR_NONE|UART_CONFIG_STOP_ONE);
  
  vParTestInitialise();
}
/*-----------------------------------------------------------*/

void vApplicationTickHook( void ){
//  static xOLEDMessage xMessage = { "PASS" };
//  static unsigned long ulTicksSinceLastDisplay = 0;
//  portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
//  
//  /* Called from every tick interrupt.  Have enough ticks passed to make it
//	time to perform our health status check again? */
//  ulTicksSinceLastDisplay++;
//  if( ulTicksSinceLastDisplay >= mainCHECK_DELAY ){
//    ulTicksSinceLastDisplay = 0;
//    
//    /* Has an error been found in any task? */
//    if( xAreGenericQueueTasksStillRunning() != pdTRUE ){
//      xMessage.pcMessage = "ERROR IN GEN Q";
//    }
//    else if( xIsCreateTaskStillRunning() != pdTRUE ){
//      xMessage.pcMessage = "ERROR IN CREATE";
//    }
//    else if( xAreIntegerMathsTaskStillRunning() != pdTRUE ){
//      xMessage.pcMessage = "ERROR IN MATH";
//    }
//    else if( xAreIntQueueTasksStillRunning() != pdTRUE ){
//      xMessage.pcMessage = "ERROR IN INT QUEUE";
//    }
//    else if( xAreBlockingQueuesStillRunning() != pdTRUE ){
//      xMessage.pcMessage = "ERROR IN BLOCK Q";
//    }
//    else if( xAreBlockTimeTestTasksStillRunning() != pdTRUE ){
//      xMessage.pcMessage = "ERROR IN BLOCK TIME";
//    }
//    else if( xAreSemaphoreTasksStillRunning() != pdTRUE ){
//      xMessage.pcMessage = "ERROR IN SEMAPHORE";
//    }
//    else if( xArePollingQueuesStillRunning() != pdTRUE ){
//      xMessage.pcMessage = "ERROR IN POLL Q";
//    }
//    else if( xAreQueuePeekTasksStillRunning() != pdTRUE ){
//      xMessage.pcMessage = "ERROR IN PEEK Q";
//    }
//    else if( xAreRecursiveMutexTasksStillRunning() != pdTRUE ){
//      xMessage.pcMessage = "ERROR IN REC MUTEX";
//    }
//    else if( xAreQueueSetTasksStillRunning() != pdPASS ){
//      xMessage.pcMessage = "ERROR IN Q SET";
//    }
//    else if( xAreEventGroupTasksStillRunning() != pdTRUE ){
//      xMessage.pcMessage = "ERROR IN EVNT GRP";
//    }
//    
//    configASSERT( strcmp( ( const char * ) xMessage.pcMessage, "PASS" ) == 0 );
//    
//    /* Send the message to the OLED gatekeeper for display. */
//    xHigherPriorityTaskWoken = pdFALSE;
//    xQueueSendFromISR( xOLEDQueue, &xMessage, &xHigherPriorityTaskWoken );
//  }
//  
//  /* Write to a queue that is in use as part of the queue set demo to
//	demonstrate using queue sets from an ISR. */
//  vQueueSetAccessQueueSetFromISR();
//  
//  /* Call the event group ISR tests. */
//  vPeriodicEventGroupsProcessing();
}
/*-----------------------------------------------------------*/

void vOLEDTask( void *pvParameters ){
  xOLEDMessage xMessage;
  unsigned long ulY, ulMaxY;
  static char cMessage[ mainMAX_MSG_LEN ];
  extern volatile unsigned long ulMaxJitter;
  const unsigned char *pucImage;
  
