gregnetzel/CPSC-5530/FreeRTOS/Demo/CORTEX_LM3Sxxxx_IAR_Keil/main.c
  /* Functions to access the OLED.  The one used depends on the dev kit
  being used. */
  void ( *vOLEDInit )( unsigned long ) = NULL;
  void ( *vOLEDStringDraw )( const char *, unsigned long, unsigned long, unsigned char ) = NULL;
  void ( *vOLEDImageDraw )( const unsigned char *, unsigned long, unsigned long, unsigned long, unsigned long ) = NULL;
  void ( *vOLEDClear )( void ) = NULL;
  
  /* Map the OLED access functions to the driver functions that are appropriate
	for the evaluation kit being used. */
  switch( HWREG( SYSCTL_DID1 ) & SYSCTL_DID1_PRTNO_MASK ){
    case SYSCTL_DID1_PRTNO_6965	:
    case SYSCTL_DID1_PRTNO_2965	:	
      vOLEDInit = OSRAM128x64x4Init;
      vOLEDStringDraw = OSRAM128x64x4StringDraw;
      vOLEDImageDraw = OSRAM128x64x4ImageDraw;
      vOLEDClear = OSRAM128x64x4Clear;
      ulMaxY = mainMAX_ROWS_64;
      pucImage = pucBasicBitmap;
      break;
  
    case SYSCTL_DID1_PRTNO_1968	:
    case SYSCTL_DID1_PRTNO_8962 :	
      vOLEDInit = RIT128x96x4Init;
      vOLEDStringDraw = RIT128x96x4StringDraw;
      vOLEDImageDraw = RIT128x96x4ImageDraw;
      vOLEDClear = RIT128x96x4Clear;
      ulMaxY = mainMAX_ROWS_96;
      pucImage = pucBasicBitmap;
      break;
  
    default:
      vOLEDInit = vFormike128x128x16Init;
      vOLEDStringDraw = vFormike128x128x16StringDraw;
      vOLEDImageDraw = vFormike128x128x16ImageDraw;
      vOLEDClear = vFormike128x128x16Clear;
      ulMaxY = mainMAX_ROWS_128;
      pucImage = pucGrLibBitmap;
      break;
  }
  
  ulY = ulMaxY;
  
  /* Initialise the OLED and display a startup message. */
  vOLEDInit( ulSSI_FREQUENCY );
  vOLEDStringDraw( "POWERED BY FreeRTOS", 0, 0, mainFULL_SCALE );
  vOLEDImageDraw( pucImage, 0, mainCHARACTER_HEIGHT + 1, bmpBITMAP_WIDTH, bmpBITMAP_HEIGHT );
  
  for( ;; ){
    /* Wait for a message to arrive that requires displaying. */
    xQueueReceive( xOLEDQueue, &xMessage, portMAX_DELAY );
    
    /* Write the message on the next available row. */
    ulY += mainCHARACTER_HEIGHT;
    if( ulY >= ulMaxY ){
      ulY = mainCHARACTER_HEIGHT;
      vOLEDClear();
      //vOLEDStringDraw( pcWelcomeMessage, 0, 0, mainFULL_SCALE );
    }
    
    /* Display the message along with the maximum jitter time from the
		high priority time test. */
    sprintf( cMessage, "%s", xMessage.pcMessage);//[%uns]", xMessage.pcMessage, ulMaxJitter * mainNS_PER_CLOCK );
    vOLEDStringDraw( cMessage, 0, ulY, mainFULL_SCALE );
  }
}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( TaskHandle_t *pxTask, signed char *pcTaskName ){
  ( void ) pxTask;
  ( void ) pcTaskName;
  
  for( ;; );
}
/*-----------------------------------------------------------*/

void vAssertCalled( const char *pcFile, unsigned long ulLine ){
  volatile unsigned long ulSetTo1InDebuggerToExit = 0;
  
  taskENTER_CRITICAL();{
    while( ulSetTo1InDebuggerToExit == 1 ){
      /* Nothing do do here.  Set the loop variable to a non zero value in
			the debugger to step out of this function to the point that caused
			the assertion. */
      ( void ) pcFile;
      ( void ) ulLine;
    }
  }
  taskEXIT_CRITICAL();
}
